liftoptimisation/0.orig/Ua
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Ua;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    minZ
    {
        type            empty;
    }
    
    maxZ
    {
        type            empty;
    }

    stlSurface
    {
        type            adjointWallVelocity;
        value           uniform ( 0 0 0 );
    }


    minX
    {
        type            adjointFarFieldVelocity;
        value           uniform ( 0 0 0 );
    }
    maxX
    {
        type            adjointFarFieldVelocity;
        value           uniform ( 0 0 0 );
    }
    minY
    {
        type            adjointFarFieldVelocity;
        value           uniform ( 0 0 0 );
    }
    maxY
    {
        type            adjointFarFieldVelocity;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
