liftoptimisation/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# resourcesDir=/OpenFOAM-v2506/tutorials/incompressible/adjointOptimisationFoam/resources

# restore0Dir

# cp -rf "$resourcesDir"/meshes/naca0012/polyMesh/ constant/

# runApplication decomposePar

# runParallel $(getApplication)
runApplication adjointOptimisationFoam

#------------------------------------------------------------------------------
