liftoptimisation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    minX
    {
        type            patch;
        nFaces          133;
        startFace       381309;
    }
    maxX
    {
        type            patch;
        nFaces          133;
        startFace       381442;
    }
    minY
    {
        type            patch;
        nFaces          150;
        startFace       381575;
    }
    maxY
    {
        type            patch;
        nFaces          150;
        startFace       381725;
    }
    minZ
    {
        type            empty;
        nFaces          45414;
        startFace       381875;
    }
    maxZ
    {
        type            empty;
        nFaces          45414;
        startFace       427289;
    }
    stlSurface
    {
        type            wall;
        nFaces          13792;
        startFace       472703;
    }
)

// ************************************************************************* //
